'use client';
import Typography from '@mui/material/Typography';
import React, { useEffect, useState } from 'react';
import { Box, Slider } from '@mui/material';
import Histogram from '../../app/histogram';
import ChartsLayout from '../../app/chart-layout';
import axios from '../../lib/axios';


export default function MilkProductionHistogram() {
  const [bins, setBins] = useState<number>(10);
  const [data, setData] = useState<{ data: number[], bins: number[] }>();

  useEffect(() => {
    axios.get<{ data: number[], bins: number[] }>(`/histograms/milk-production?bins=${bins}`).then(res => {
      setData(res.data);
    });
  }, [bins]);

  return (
    <ChartsLayout
      description={
        <Typography>
          هیستوگرام نوعی نمودار است که به ما کمک می کند تا توزیع یا گسترش یک مجموعه خاص از داده ها را درک کنیم. در این
          مورد، هیستوگرام داده های تولید شیر را برای مزرعه لبنی مجسم می کند.
          <br/>
          <br/>
          محور افقی که به عنوان محور x نیز شناخته می شود، محدوده یا دسته های مختلف تولید شیر را نشان می دهد. این دسته ها
          را می توان بر حسب وزن و کیلوگرم شیر تعریف شده است. هر دسته یا محدوده با یک نوار در نمودار نشان
          داده می شود.
          <br/>
          <br/>
          محور عمودی، همچنین به عنوان محور y شناخته می شود، نشان دهنده فراوانی یا تعداد وقوع برای هر دسته یا محدوده
          تولید شیر است. این نشان می دهد که چند بار محدوده خاصی از تولید شیر در مجموعه داده مشاهده شده است.
          <br/>
          <br/>
          ارتفاع هر میله در نمودار مربوط به دفعات یا تعداد تولید شیر است که در آن محدوده خاص قرار دارد. بنابراین، میله
          های بلندتر نشان دهنده فرکانس بالاتر تولید شیر در آن محدوده است.
          <br/>
          <br/>
          با مشاهده هیستوگرام، دامدار می تواند بینش هایی به دست آورد. مثلا:
          <br/>
          <br/>
          نمودار می تواند رایج ترین یا معمولی ترین محدوده تولید شیر را نشان دهد. بلندترین نوار محدوده با بیشترین فرکانس
          را نشان می دهد و سطح معمول تولید شیر را نشان می دهد.
          کشاورز می تواند هر گونه الگوهای پرت یا غیرعادی را در داده ها شناسایی کند. اگر میله هایی وجود داشته باشد که به
          طور قابل توجهی از بقیه متمایز باشد، نشان می دهد که ممکن است مقادیر استثنایی تولید شیر وجود داشته باشد که نیاز
          به توجه دارند.
          <br/>
          <br/>
          نمودار همچنین نمای کلی از توزیع تولید شیر را ارائه می دهد. این نشان می‌دهد که چگونه داده‌ها در محدوده‌های
          مختلف پخش می‌شوند و ایده‌ای از تنوع در سطوح تولید شیر ارائه می‌دهد.
          به طور کلی، این نمودار هیستوگرام به کشاورز کمک می کند تا توزیع تولید شیر را به روشی ساده و شهودی تجسم و درک
          کند و به آنها اجازه می دهد تا تصمیمات آگاهانه ای در مورد عملیات مزرعه لبنی خود بگیرند.
        </Typography>
      }
      controls={
        <Box sx={{ px: 2 }}>

          <Typography>
            دقت محور افقی
            ({bins})
          </Typography>
          <Slider

            id='bins-input'
            name='bins'
            value={bins}
            min={1}
            max={100}
            step={1}
            onChange={(event, value) => setBins(value as number)}
            marks={[{ value: 1, label: '1' }, { value: 100, label: '100' }]}
          />
        </Box>
      }
      title={'نمودار توزیع تولید شیر'}
      chart={data && <Histogram data={data} />}


    />
  );
}
